var Competencies = {
    "УК-1": "Способен осуществлять поиск, критический анализ и синтез информации, применять системный подход для решения поставленных задач",
    "УК-2": "Способен определять круг задач в рамках поставленной цели и выбирать оптимальные способы их решения, исходя из действующих правовых норм, имеющихся ресурсов и ограничений",
    "УК-3": "Способен осуществлять социальное взаимодействие и реализовывать свою роль в команде",
    "УК-4": "Способен осуществлять деловую коммуникацию в устной и письменной формах на государственном языке Российской Федерации и иностранном(ых) языке(ах)",
    "УК-5": "Способен воспринимать межкультурное разнообразие общества в социально-историческом, этическом и философском контекстах",
    "УК-6": "Способен управлять своим временем, выстраивать и реализовывать траекторию саморазвития на основе принципов образования в течение всей жизни",
    "УК-7": "Способен поддерживать должный уровень физической подготовленности для обеспечения полноценной социальной и профессиональной деятельности",
    "УК-8": "Способен создавать и поддерживать безопасные условия жизнедеятельности, в том числе при возникновении чрезвычайных ситуаций",

    "ОПК-1": "Способен применять естественнонаучные и общеинженерные знания, методы математического анализа и моделирования, теоретического и экспериментального исследования в профессиональной деятельности",
    "ОПК-2": "Способен использовать современные информационные технологии и программные средства, в том числе отечественного производства, при решении задач профессиональной деятельности",
    "ОПК-3": "Способен решать стандартные задачи профессиональной деятельности на основе информационной и библиографической культуры с применением информационно-коммуникационных технологий и с учетом основных требований информационной безопасности",
    "ОПК-4": "Способен участвовать в разработке стандартов, норм и правил, а также технической документации, связанной с профессиональной деятельностью",
    "ОПК-5": "Способен инсталлировать программное и аппаратное обеспечение для информационных и автоматизированных систем",
    "ОПК-6": "Способен разрабатывать бизнес-планы и технические задания на оснащение отделов, лабораторий, офисов компьютерным и сетевым оборудованием",
    "ОПК-7": "Способен участвовать в настройке и наладке программно-аппаратных комплексов",
    "ОПК-8": "Способен разрабатывать алгоритмы и программы, пригодные для практического применения",
    "ОПК-9": "Способен осваивать методики использования программных средств для решения практических задач",

    "ПК-1":	"Способен разрабатывать графический дизайн интерфейса, проектировать пользовательские интерфейсы по готовому образцу или концепции интерфейса",
    "ПК-2":	"Способен разрабатывать компоненты системных программных продуктов",
    "ПК-3":	"Способен разрабатывать требования к программному обеспечению",
    "ПК-4":	"Способен проектировать программное обеспечение",
    "ПК-5":	"Способен проводить юзабилити- исследование программных продуктов",
    "ПК-6":	"Способен проводить юзабилити- исследование аппаратных средств"
};
