Subject = {
    "Философия": {
        "Кафедра": "Филос",
        "Компетенции": "УК1 УК5"
    },

    "История России": {
        "Кафедра": "ИГиП",
        "Компетенции": "УК5"
    },

    "Всеобщая история": {
        "Кафедра": "ИГиП",
        "Компетенции": "УК5"
    },

    "Иностранный язык": {
        "Кафедра": "ИЯ",
        "Компетенции": "УК4"
    },

    "Безопасность жизнедеятельности": {
        "Кафедра": "ОТиОС",
        "Компетенции": "УК8"
    },

    "Физическая культура и спорт": {
        "Кафедра": "ФВиС",
        "Компетенции": "УК7"
    },

    "Физическая культура и спорт (элективнй модуль)": {
        "Кафедра": "ФВиС",
        "Компетенции": "УК7"
    },

    "Экономика": {
        "Кафедра": "ФиМ",
        "Компетенции": "УК2"
    },

    "Психология лидерства и командной работы": {
        "Кафедра": "Псих",
        "Компетенции": "УК3, УК6"
    },

    "Деловая коммуникация": {
        "Кафедра": "ООД",
        "Компетенции": "УК4"

    },

    "Социальные и политические институты и процессы в современном обществе": {
        "Кафедра": "СиП	",
        "Компетенции": "УК5"
    },

    "Математика": {
        "Кафедра": "ВММ",
        "Компетенции": "ОПК1"
    },

    "Физика": {
        "Кафедра": "Физика",
        "Компетенции": "ОПК1"
    },

    "Электротехника и электроника": {
        "Кафедра": "ЭТЭО",
        "Компетенции": "ОПК1"
    },

    "Информатика": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК2 ОПК9"
    },

    "Архитектура вычислительных систем": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК7"
    },

    "Компьютерные сети и телекоммуникации": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК6 ОПК7"
    },

    "Базы данных": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК3 ОПК9"
    },

    "Программирование": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК2 ОПК8"
    },

    "Операционные системы и среды": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК5"
    },

    "Проектирование информационных систем": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК4"
    },

    "Спец. Разделы высшей математики (дискретная математика, матлогика, теория графов)": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК1"
    },

    "Численные методы": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК1"
    },

    "Математическая статистика (теория вер.)": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК1 ОПК2"
    },

    "Структуры и алгоритмы обработки данных": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК8 ОПК9"
    },

    "Прикладные компьютерные технологии": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК2"
    },

    "Основы моделирования систем": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК1"
    },

    "Управление проектной деятельностью / Бизнес-планирование / Предпринимательская деятельность": {
        "Кафедра": "ФиМ / ФиМ / ГУиВЭД ",
        "Компетенции": "УК2 УК3"
    },

    "Технологии самореализации и саморазвития личности / Технологии самореализации и саморазвития человека с ограниченными возможностями здоровья": {
        "Кафедра": "ТиМО",
        "Компетенции": "УК6"
    },

    "Правоведение / Коррупция: причины, проявления, противодействие / Антикоррупционное мировоззрение": {

        "Кафедра": "ГиАП / КиПП",
        "Компетенции": "УК2"
    },

    "Системное программное обеспечение": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК2 ПК4"
    },

    "Инженерный дизайн CAD": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК1 ПК5"
    },

    "Лингвистическое и программное обеспечение автоматизированных систем": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК3 ПК4"
    },

    "Электронные вычислительные машины и периферийные устройства": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК3 ПК5 ПК6"
    },

    "Микропроцессорные системы": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК4 ПК6"
    },

    "Цифровая схемотехника": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК2 ПК6"
    },

    "Операционные системы семейства UNUX": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК1 ПК2"
    },

    "Автоматизация конструкторского и технологического проектирования": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК4 ПК5 ПК6"
    },

    "Проектирование человеко-машинных интерфейсов": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК1 ПК5 ПК6"
    },

    "Теория алгоритмов и автоматов": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК3"
    },

    "Сетевое программирование": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК3 ПК4 ПК5"
    }

};