var Subjects = {
    "Философия": {
        "Кафедра": "Филос",
        "Компетенции": "УК-1 УК-5"
    },

    "История России": {
        "Кафедра": "ИГиП",
        "Компетенции": "УК5-"
    },

    "Всеобщая история": {
        "Кафедра": "ИГиП",
        "Компетенции": "УК-5"
    },

    "Иностранный язык": {
        "Кафедра": "ИЯ",
        "Компетенции": "УК-4"
    },

    "Безопасность жизнедеятельности": {
        "Кафедра": "ОТиОС",
        "Компетенции": "УК-8"
    },

    "Физическая культура и спорт": {
        "Кафедра": "ФВиС",
        "Компетенции": "УК-7"
    },

    "Физическая культура и спорт (элективнй модуль)": {
        "Кафедра": "ФВиС",
        "Компетенции": "УК-7"
    },

    "Экономика": {
        "Кафедра": "ФиМ",
        "Компетенции": "УК-2"
    },

    "Психология лидерства и командной работы": {
        "Кафедра": "Псих",
        "Компетенции": "УК-3 УК-6"
    },

    "Деловая коммуникация": {
        "Кафедра": "ООД",
        "Компетенции": "УК-4"

    },

    "Социальные и политические институты и процессы в современном обществе": {
        "Кафедра": "СиП	",
        "Компетенции": "УК-5"
    },

    "Математика": {
        "Кафедра": "ВММ",
        "Компетенции": "ОПК-1"
    },

    "Физика": {
        "Кафедра": "Физика",
        "Компетенции": "ОПК-1"
    },

    "Электротехника и электроника": {
        "Кафедра": "ЭТЭО",
        "Компетенции": "ОПК-1"
    },

    "Информатика": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК-2 ОПК-9"
    },

    "Архитектура вычислительных систем": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК-7"
    },

    "Компьютерные сети и телекоммуникации": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК-6 ОПК-7"
    },

    "Базы данных": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК-3 ОПК-9"
    },

    "Программирование": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК-2 ОПК-8"
    },

    "Операционные системы и среды": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК-5"
    },

    "Проектирование информационных систем": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК-4"
    },

    "Спец. Разделы высшей математики (дискретная математика, матлогика, теория графов)": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК-1"
    },

    "Численные методы": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК-1"
    },

    "Математическая статистика (теория вер.)": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК-1 ОПК-2"
    },

    "Структуры и алгоритмы обработки данных": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК-8 ОПК-9"
    },

    "Прикладные компьютерные технологии": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК-2"
    },

    "Основы моделирования систем": {
        "Кафедра": "ВТ",
        "Компетенции": "ОПК-1"
    },

    "Управление проектной деятельностью / Бизнес-планирование / Предпринимательская деятельность": {
        "Кафедра": "ФиМ / ФиМ / ГУиВЭД ",
        "Компетенции": "УК-2 УК-3"
    },

    "Технологии самореализации и саморазвития личности / Технологии самореализации и саморазвития человека с ограниченными возможностями здоровья": {
        "Кафедра": "ТиМО",
        "Компетенции": "УК-6"
    },

    "Правоведение / Коррупция: причины, проявления, противодействие / Антикоррупционное мировоззрение": {

        "Кафедра": "ГиАП / КиПП",
        "Компетенции": "УК-2"
    },

    "Системное программное обеспечение": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК-2 ПК-4"
    },

    "Инженерный дизайн CAD": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК-1 ПК-5"
    },

    "Лингвистическое и программное обеспечение автоматизированных систем": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК-3 ПК-4"
    },

    "Электронные вычислительные машины и периферийные устройства": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК-3 ПК-5 ПК-6"
    },

    "Микропроцессорные системы": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК-4 ПК-6"
    },

    "Цифровая схемотехника": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК-2 ПК-6"
    },

    "Операционные системы семейства UNUX": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК-1 ПК-2"
    },

    "Автоматизация конструкторского и технологического проектирования": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК-4 ПК-5 ПК-6"
    },

    "Проектирование человеко-машинных интерфейсов": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК-1 ПК-5 ПК-6"
    },

    "Теория алгоритмов и автоматов": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК-3"
    },

    "Сетевое программирование": {
        "Кафедра": "ВТ",
        "Компетенции": "ПК-3 ПК-4 ПК-5"
    }

};