var GLOBAL_TrainingProfile=[
   "Вычислительные машины, комплексы, системы и сети",
   "Автоматизированные системы обработки информации и управления",
   "Программное обеспечение средств вычислительной техники и автоматизированных систем",
   "Системы автоматизированного проектирования",
   "Электронно-вычислительные машины, комплексы, системы и сети",
   "Системы автоматизированного проектирования",
   "Информационные системы",
   "Прикладная информатика в промышленности",
   "Прикладная информатика в экономике",
];